jrecorder/app/controllers/products_controller.rb

  def index
    puts "3333333", params.inspect
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Small Cotton Pants"], ["price", 2], ["created_at", "2015-04-21 07:28:06.210619"], ["updated_at", "2015-04-21 07:28:06.210619"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?

    def set_product
      @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]