html5-recorder/app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "audio_file_size" = ?, "audio_updated_at" = ?, "audio_file_name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["audio_file_size", 1253422], ["audio_updated_at", "2015-04-23 02:57:08.070280"], ["audio_file_name", "audio.wav"], ["updated_at", "2015-04-23 02:57:08.105366"], ["id", 1]]
---
  def create_audio
    puts "xxxxx", params[:audio]
    @product = Product.find(params[:id])
    @product.update_attributes!(:audio => params[:audio])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_product
      @product = Product.find(params[:id])