todos-api/app/controllers/api/v1/items_controller.rb

  def update
    @item.assign_attributes(item_params)
    if @item.save
---
UPDATE "items" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["name", "building API"], ["description", "building API"], ["updated_at", "2015-04-20 14:24:40.914235"], ["id", 1]]

    def find_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]