voice-recording/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "audio_file_name", "audio_content_type", "audio_file_size", "audio_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    # respond_to do |format|
    if @user.save

UPDATE "users" SET "encrypted_password" = ?, "audio_file_size" = ?, "audio_updated_at" = ?, "audio_file_name" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    @user.assign_attributes(user_params)
    if @user.save